from Crypto.Cipher import AES
from Crypto.Util.Padding import pad


def encrypt(data, key):
    '''
    یک وکتور استاتیک ایجاد کنید، رمزگذاری با استفاده از AES و حالت CBC.
سپس داده‌ها را با استفاده از رمزگذاری با پر کردن تا اندازه بلوک، رمزنگاری کنید و آن را بازگردانید.
@param data: داده‌هایی که باید رمزنگاری شوند.
@param key: کلید رمزنگاری.
@return: داده‌های رمزنگاری شده.
    '''
def decrypt(data, key):
    '''
    یک وکتور استاتیک ایجاد کنید، رمزگذاری با استفاده از AES و حالت CBC.
سپس داده‌ها را با استفاده از رمزگذاری با پر کردن تا اندازه بلوک، رمزنگاری کنید و آن را بازگردانید.
@param data: داده‌هایی که باید رمزنگاری شوند.
@param key: کلید رمزنگاری.
@return: داده‌های رمزنگاری شده.
    '''orical
orical