import unicodedata
from flask import Flask, request, escape, render_template

app = Flask(__name__,template_folder='templates')


@app.route("/result")
def result():
    '''
    داده‌های رابط کاربری را از درخواست با استفاده از 'ui_data' دریافت کنید، پس از فرار کردن آن‌ها نرمال‌سازی کنید و به الگو از templates/result.html منتقل کنید. 
    :برگرداندن: الگوی رندر شده.
    '''
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخواست کرد؟
    :برگرداندن: کاربری
    """orical
 @"
    چه‌یک کاربری را درخ