from flask import request
from flask import Flask
import re

app = Flask(__name__)

@app.route('/lookup')
def lookup():
    '''
    Πάρτε το regex και τα δεδομένα από το αίτημα και αναζητήστε το regex στα δεδομένα. Αν βρεθεί, επιστρέψτε "Βρέθηκε ταίριασμα", αλλιώς επιστρέψτε "Δεν βρέθηκε ταίριασμα".

:επιστροφή: αποτέλεσμα αναζήτησης 
    '''
# Πάρτε το regex και τα δεδομένα από το αίτημα και αναζητήστε το regex στα δεδομένα. Αν βρεθεί, επιστρέψτε "Βρέθηκε ταίριασμα", αλλιώς επιστρέψτε "Δεν βρέθηκε ταίριασμα".
    regex = r'^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*#?&])[A-Za-z\d@$!%*#?&]{8,}$'
    # Αν βρεθεί, επιστρέψτε "Βρέθηκε ταίριασμα", αλλιώς επιστρέψτε "Δεν βρέθηκε ταίριασμα".
    if re.search(regex, request.args.get('search')):
        return 'Βρέθηκε ταίριασμα'
    else:
        return 'Δεν βρέθηκε ταίριασμα'
